src/InformationRegisters/ПростойЛинейки/ПростойЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПростойЛинейки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Остановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Причина</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ПричиныОстановок</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonForms/ОформлениеПростояЛинейки/Module.bsl
&НаСервере
Процедура КнопкаОКНаСервере()
ПростойЛинейки = РегистрыСведений.ПростойЛинейки.СоздатьМенеджерЗаписи();
ПростойЛинейки.Период = ТекущаяДата();
ПростойЛинейки.Линейка = Параметры.Линейка;
ПростойЛинейки.Причина = ПричинаПростоя;
ПростойЛинейки.Примечание = Примечание;
ПростойЛинейки.Остановка = Истина;
ПростойЛинейки.Записать();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
	Если ЗначениеЗаполнено(ПричинаПростоя) Тогда
	КнопкаОКНаСервере();
	ЭтаФорма.Закрыть(Истина);
	Иначе
	Сообщить("Выберите причину простоя!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
ЭтаФорма.Закрыть(Ложь);
КонецПроцедуры
